Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИспользованиеХарактеристик</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыИспользованияХарактеристикНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНоменклатуры</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>B2B_СЭ_ТипНоменклатуры</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.B2B_СЭ_ТипНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>B2B_Портал</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.B2B_Портал</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>B2B_СЭ_НоменклатураДляВыгрузки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКартинки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>B2B_ГруппаНаСайтеОсновная</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.B2B_Б_ПользовательскиеГруппыТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>B2B_НазваниеWeb</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>B2B_ГруппыНаСайте</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.B2B_Б_ПользовательскиеГруппыТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Номенклатура/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура гф_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)                  
	
	
	НовоеПолеСтраница = Элементы.Вставить("гф_СтраницаB2B", Тип("ГруппаФормы"),
										Элементы.СтраницыКарточкаНоменклатуры);
	НовоеПолеСтраница.Вид = ВидГруппыФормы.Страница;	
	НовоеПолеСтраница.Видимость = Истина;
	НовоеПолеСтраница.Заголовок = "B2B дополнительные реквизиты";
	//НовоеПолеСтраница.ПутьКДаннымЗаголовка = "Объект.гф_ТоварыВКоробах.КоличествоСтрок";
	
	НовоеПоле = Элементы.Добавить("B2B_Портал", Тип("ПолеФормы"), НовоеПолеСтраница);
	НовоеПоле.Заголовок = "B2B_Портал";
	НовоеПоле.Вид = ВидПоляФормы.ПолеВвода;
	НовоеПоле.ПутьКДанным = "Объект.B2B_Портал";   
	
	НовоеПоле = Элементы.Добавить("B2B_НазваниеWeb", Тип("ПолеФормы"), НовоеПолеСтраница);
	НовоеПоле.Заголовок = "B2B_НазваниеWeb";
	НовоеПоле.Вид = ВидПоляФормы.ПолеВвода;
	НовоеПоле.ПутьКДанным = "Объект.B2B_НазваниеWeb";   

	
	НовоеПоле = Элементы.Добавить("B2B_ГруппаНаСайтеОсновная", Тип("ПолеФормы"), НовоеПолеСтраница);
	НовоеПоле.Заголовок = "Группа на сайте (основная)";
	НовоеПоле.Вид = ВидПоляФормы.ПолеВвода;
	НовоеПоле.ПутьКДанным = "Объект.B2B_ГруппаНаСайтеОсновная";
	//НовоеПоле.УстановитьДействие("ПриИзменении", "гф_ТоварыВКоробахВариантКомплектацииПриИзменении");
	
	НовоеПоле = Элементы.Добавить("B2B_ГруппыНаСайте", Тип("ТаблицаФормы"), НовоеПолеСтраница);
	НовоеПоле.Заголовок = "Группы на сайте";
	НовоеПоле.ПутьКДанным = "Объект.B2B_ГруппыНаСайте";   
	НовоеПоле.Видимость					= Истина;
	НовоеПоле.Отображение				= ОтображениеТаблицы.Список; 
	НовоеПоле.ПоложениеЗаголовка		= ПоложениеЗаголовкаЭлементаФормы.Лево;
	НовоеПоле.КоманднаяПанель.Видимость = Ложь;
	НовоеПоле.ВариантУправленияВысотой	= ВариантУправленияВысотойТаблицы.ПоСодержимому; 
	
	НовоеПоле = Элементы.Добавить("B2B_ГруппыНаСайте_Группа", Тип("ПолеФормы"), Элементы.B2B_ГруппыНаСайте);
	НовоеПоле.Вид			= ВидПоляФормы.ПолеВвода;
	НовоеПоле.Видимость		= Истина;
	НовоеПоле.ПутьКДанным	= "Объект.B2B_ГруппыНаСайте.Группа";
	
	// ++ СадомцевСА 18.10.2023 Добавил кнопку Перейти - Варианты комплектации
	// при условии что функциональная опция "Использовать сборку зарборку" ВЫКЛЮЧЕНА
	// e1cib/data/Задача.ЗадачаИсполнителя?ref=8eabb083fed1320811ee6d0442ba9c05 (п.1)
	ИспользоватьСборкуРазборку = ПолучитьФункциональнуюОпцию("ИспользоватьСборкуРазборку");
	Если НЕ ИспользоватьСборкуРазборку Тогда
		//Создаем Команду
		НоваяКоманда = ЭтаФорма.Команды.Добавить("гф_ПерейтиВариантыКомплектации");
		НоваяКоманда.Действие = "гф_ВыполнитьПерейтиВариантыКомплектации";//Имя процедуры
		НоваяКоманда.Заголовок = "Варианты комплектации";
		//Создаем Кнопку
		НоваяКнопка = ЭтаФорма.Элементы.Вставить("гф_КнопкаПерейтиВариантыКомплектации", Тип("КнопкаФормы"), Элементы.ГруппаКнопокПроизводство);
		НоваяКнопка.ИмяКоманды = "гф_ПерейтиВариантыКомплектации";
	КонецЕсли;
	// -- СадомцевСА 18.10.2023
	
КонецПроцедуры

&НаКлиенте
Процедура гф_ВыполнитьПерейтиВариантыКомплектации(Команда)
	ГиперссылкаПерейтиСформироватьПараметрыИВопрос("ГиперссылкаПерейтиВариантыКомплектации", "");
КонецПроцедуры
